{
  "ADV.F": "adverbial form: a form that connects to auxiliary verbs or functions adverbially. Ex: ikite, yominu.",
  "ATTR": "attributive: a form used to modify nouns. Often seen in adjectives or auxiliary verbs. Ex: yomeru uta.",
  "CNTFCT.AUX": "Counterfactual: The auxiliary verb 'mashi' expressing hypothetical or counterfactual situations contrary to reality. Example: mimashikaba ('if I had seen').",
  "CNTFCT.COND": "Counterfactual conditional: A conditional clause expressing hypothetical or counterfactual situations. Example: moshi ame ga futta naraba ('if it had rained').",
  "COMP.ATTR": "completive attributive: attributive form of auxiliaries indicating completion or emphasis, such as 'nu' or 'tsu'. Ex: okonainuru.",
  "COND.F": "conditional form: form used in modern Japanese for conditional expressions with 'ba'. Ex: tabereba, ikeba.",
  "EMPH": "emphatic: used to emphasize elements in a sentence, such as the particles 'shi' or 'koso'.",
  "EXC": "exclamative: used to express emotion through exclamatory expressions or particles. Ex: ana, kana.",
  "FOC.PRT": "focus particle: a particle that emphasizes part of a sentence, such as dani, sura, sae.",
  "HESIT.AUX": "Hesitation: The auxiliary verb 'mashi' expressing hesitation or indecision. Example: iwamashi ('I might say').",
  "HON": "honorific: a respectful form of speech, used for showing respect towards the subject. Examples: ohasu (to be).",
  "HON.IMP": "honorific imperative: An honorific form used to give respectful commands or requests. Example: tamahe (please do).",
  "HUM": "humble: a form of speech used to show humility towards the listener or subject. Examples: saburafu (to serve), makade (to leave).",
  "HUM.IMP": "humble imperative: A humble form used to express commands or requests humbly. Example: saburahe (please serve).",
  "IMPER.F": "imperative form: the form used to express direct commands. Ex: ike, yome.",
  "IRR": "irrealis: the unrealis (non-actual) form used before auxiliaries expressing intention, conjecture, potential, or causative. Example: ikaba ('if I go'), ikamu ('I will go').",
  "LEX.F": "lexical form: the base dictionary form, used as the citation form and for plain present/future tense. Ex: iku, yomu.",
  "NEG.BASE": "negation base: the base form used specifically before negative expressions (e.g., 'zu'). Example: ikazu ('not go').",
  "POL": "polite (polite form: mashi, masu, etc.)",
  "POT.AUX": "Potential: The auxiliary or suffix expressing potentiality or possibility. Example: ikeru ('can go'), taberareru ('can eat').",
  "REALIS.F": "realis form: a form used in contexts assuming the truth of an event, such as conditions or concessives. Ex: ikeba, yomedomo.",
  "REPT": "repetitive: expression using word repetition for emphasis or continuity. Ex: madohi-madou.",
  "SPONT": "Spontaneous: a lexical or grammatical category indicating spontaneous, unintentional, or naturally occurring actions or states, typically expressed in verbs like miyu ('be visible'), kikoyu ('be audible'), omohoyu ('come to mind').",
  "STAT": "stative: expresses states or conditions rather than actions. Ex: ari, tari.",
  "STAT.ATTR": "stative attributive: attributive form of stative auxiliaries like 'ri'. Ex: yomeru.",
  "VOL.F": "volitional form: expresses intention or suggestion. Ex: ikou, yomou.",
  "WISH.AUX": "Wish: The auxiliary verb 'mashi' expressing desire or wishful thinking. Example: yo ni aramashikaba ('if only I had existed in this world')."
}
